Revit 2024 API
ExternalDefinitionCreationOptions Class
 An option class used for creating a new shared parameter definition, including options such as name, type, visibility, Guid description and modifiable flag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class ExternalDefinitionCreationOptions : IDisposable
Visual Basic
Public Class ExternalDefinitionCreationOptions _
	Implements IDisposable
Visual C++
public ref class ExternalDefinitionCreationOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalDefinitionCreationOptions
See Also
ExternalDefinitionCreationOptions Members
Autodesk.Revit.DB Namespace